# Первый вариант
print("Введите три длины сторон треугольника")
a = float(input("Сторона a = "))
b = float(input("Сторона b = "))
c = float(input("Сторона c = "))
if a + b <= c and a + c <= b and b + c <= a:
    print(f"Треугольника со сторонами {a = } , {b = } , {c = } - быть не может")
elif a != b and a != c and b != c:
    print(f"Треугольник со сторонами {a = } , {b = } , {c = } - разносторонний")
elif a == b == c:
    print(f"Треугольник со сторонами {a = } , {b = } , {c = } - равносторонний")
else:
    print(f"Треугольник со сторонами {a = } , {b = } , {c = } - равнобедренный")

# Второй вариант

print("Введите три длины сторон треугольника")
a = float(input("Сторона a = "))
b = float(input("Сторона b = "))
c = float(input("Сторона c = "))
if a + b <= c and a + c <= b and b + c <= a:
    d = "не может существовать"
elif a != b and a != c and b != c:
    d = "разносторонний"
elif a == b == c:
    d = "равносторонний"
else:
    d = "равнобедренный"
print(f"Треугольник со сторонами {a = } , {b = } , {c = } - {d}")
