print('Введите координаты точки А(х1;y1)')
x1 = float(input("X1 = "))
y1 = float(input("Y1 = "))
print('Введите координаты точки B(х2;y2)')
x2 = float(input("X2 = "))
y2 = float(input("Y2 = "))
print(f'Вы ввели координаты точек: А = ({x1 = } : {y1 = }) B = ({x2 = } : {y2 = })')
k = (y1 - y2) / (x1 - x2)
b = y2 - k*x2
print(f' Y = {k:.2f}*X + {b:.2f}')

#То же самое с проверкой деления на ноль
print('Введите координаты точки А(х1;y1)')
x1 = float(input("X1 = "))
y1 = float(input("Y1 = "))
print('Введите координаты точки B(х2;y2)')
x2 = float(input("X2 = "))
y2 = float(input("Y2 = "))
print(f'Вы ввели координаты точек: А = ({x1 = } : {y1 = }) B = ({x2 = } : {y2 = })')
if x1 - x2 == 0:
    print(f"С координатами {x1 = } и {x2 = } не получается решения ибо на ноль делить нельзя")
else:
    k = (y1 - y2) / (x1 - x2)
    b = y2 - k*x2
    print(f' Y = {k:.2f}*X + {b:.2f}')
    
